[
    {
        "date": "Nov 27, 2023",
        "title": "My First Post!",
        "keywords": "Portfolio, MERN, JavaScript",
        "icon": "FaLaptopCode",
        "content": [
            "I finally created my first portfolio website and published a blog on it!",
            "It truly was quite the experience, with my second time taking a deep dive into the realms of MERN (well technically, only RN because this doesn't have any database, yet).",
            "Needless to say, I wanted this site to truly reflect my abilities as accurately as possible, as well as my artistic ability. Every single color palette, layout and design choice was made by me, every animation, effect and JavaScript written from scratch.",
            "Of course I encountered tons of bugs along the way, especially with as complex of a dynamic background, transitions and various effects as shown here, but every single time, my initial frustration and head-bashing was quickly replaced with a surge of elation. And it just kept getting better and better as page after page, I knew I was approaching the day.",
            "**That day is today. DethCubeHax, signing out.**"
        ]
    },
    {
        "date": "Nov 29, 2023",
        "title": "Homepage update: Console!",
        "keywords": "Terminal, Projects, JavaScript",
        "icon": "FaTerminal",
        "content": [
            "Having way too much 'free' time than I should for a penultimate university student with his finals approaching, I decided to add a fancy new Terminal to the mix, and totally did NOT do this by hand 💀...",
            "Having said that though, this console will now allow visitors to ask questions about me or navigating the site, as well as some other additions for the interested to find out ;).",
            "It features some really cool stuff, such as my age in years, correct to 10 decimal places since my birthday, as well as counts of my projects, work-experiences, publications and the like. Naturally having such *infinite* time at my disposal, of course I made the wise decision of hardcoding these counts for the time being because I do not have the time, nor the energy to pull off a dynamic system to do this.",
            "If only there was an easier way to impress the hiring team... As they say, life could be a dream, but it is not.",
            "**DethCubeHax, signing out.**"
        ]
    },
    {
        "date": "Jul 07, 2024",
        "title": "Milestone: Penultimate Year Intern at SCB!",
        "keywords": "Internship, SME, Banking",
        "icon": "FaBriefcase",
        "content": [
            "Amidst the whirlwind of university life and the constant juggle of assignments, I somehow managed to land an internship at Standard Chartered Bank in their SME Banking division! 🎉 Talk about a plot twist in my academic saga.",
            "**From day one, it's been a rollercoaster of learning, challenges, and yes, a fair share of coffee-fueled late nights. Who knew the world of SME banking could be so intricate? Certainly not my pre-intern self, who thought 'requirements engineering' was just a fancy word for a task that is trivial at best.**",
            "**One of the highlights? Getting to work on real projects that actually impact real businesses. It's both exhilarating and slightly terrifying.** There I was, a student who still occasionally burns PCBs on a regular basis, helping craft strategies that could influence the financial health of small and medium enterprises. Talk about imposter syndrome on steroids!",
            "Of course, no internship would be complete without its fair share of Excel spreadsheets. I swear, by the end of this, I'll be able to pivot table in my sleep. Who needs party tricks when you can impress people with your VLOOKUP skills, right?",
            "**But jokes aside, this experience has been eye-opening.** It's one thing to learn about banking in textbooks, and a whole other ball game to see it in action. The teamwork, the problem-solving, the way everyone comes together to support our SME clients – it's pretty inspiring stuff.",
            "As I plough through and sponge up the experiences in this internship and head to my final year, I can't help but feel a mix of gratitude and excitement. Grateful for the opportunity and the amazing mentors I have, and excited for what's next. **Who knows, SCB will hire me after graduation... or maybe I'll start my own SME and become a client instead. The plot thickens!**",
            "**DethCubeHax, signing out (and off to practice my firm handshake for future networking events).**"
        ]
    },
    {
        "date": "Nov 15, 2024",
        "title": "Bringing AI to Life: My Journey with a RAG Chatbot",
        "keywords": "AI, FastAPI, Chatbot",
        "icon": "FaRobot",
        "content": [
            "Hello, tech enthusiasts and fellow developers!",
            "Today, I'm thrilled to share my latest project: implementing a Retrieval-Augmented Generation (RAG) AI chatbot using Ollama and local embeddings, hosting it on a FastAPI server, and making it accessible via my website's terminal using Telebit. This journey has been a blend of intense coding, problem-solving, and a lot of learning. Let's dive into the details!",
            "**Step 1: Setting Up Ollama and Local Embeddings**\nThe first step was to integrate Ollama, a powerful AI model, with local embeddings. This combination allows the chatbot to retrieve relevant information efficiently and generate accurate responses.",
            "**Step 2: Hosting on FastAPI**\nNext, I needed a robust and scalable server to host the chatbot. FastAPI was the perfect choice due to its speed and ease of use.",
            "**Step 3: Exposing the API with Telebit**\nTo make the API accessible over the internet, I used Telebit, a tool that provides secure tunnels to localhost.",
            "**Step 4: Connecting to the Website Terminal**\nFinally, I integrated the chatbot with my website's terminal. This involved some JavaScript to handle user inputs and display responses.",
            "And there you have it! A fully functional RAG AI chatbot integrated into my website's terminal. This project has been a fantastic learning experience, and I hope it inspires you to explore the exciting world of AI and web development.",
            "**Until next time, happy coding!**",
            "**DethCubeHax, signing out.**"
        ]
    },
    {
        "date": "Dec 01, 2024",
        "title": "Pushing Boundaries: Enhancements to My Portfolio Site",
        "keywords": "Web Development, MERN, User Experience",
        "icon": "FaTools",
        "content": [
            "Greetings, fellow tech adventurers and web enthusiasts!",
            "I'm elated to share the latest enhancements I've made to my portfolio website. If you've been following my journey, you know that my site is more than just a digital resume—it's a living, breathing testament to my love for tech and design. Let's dive into the whirlwind of updates that took my site to the next level!",
            "**Dynamic Backgrounds & Animations**\nFirst things first, let's talk visuals. The static backgrounds have been replaced with dynamic, ever-changing animations that keep the site feeling fresh and engaging. Each element, from the subtle particle effects to the mesmerizing gradients, is designed to captivate and invite exploration.",
            "**Enhanced User Interface (UI)**\nNext up, the user interface. I've streamlined the navigation, making it more intuitive and user-friendly. The menu items are now more accessible, and I've added smooth transitions that guide the eye effortlessly from one section to the next. The result? A seamless browsing experience that's both enjoyable and efficient.",
            "**Performance Optimization**\nBehind the scenes, I've done some serious housekeeping. The site now loads faster than ever, thanks to optimized images, minified code, and improved caching strategies. This means less waiting and more exploring for you!",
            "**AI Chatbot Integration**\nOne of the standout features is the integration of an AI chatbot. This isn't just any chatbot—it's a RAG (Retrieval-Augmented Generation) model powered by FastAPI and local embeddings, hosted and accessible via my website's terminal using Telebit. It can answer questions, provide site navigation assistance, and even share some fun facts about my projects.",
            "**Real-Time Age Calculation**\nFor those of you who've been curious about my real-time age feature—yes, it's back and better than ever! This nifty little script calculates my age down to the second, and displays it dynamically on the site. Because let's face it, who doesn't want to know exactly how old I am at any given moment?",
            "**Mobile-Friendly Design**\nLast but not least, I've made significant improvements to the mobile experience. The site now looks and functions beautifully on smartphones and tablets, ensuring that you get the full experience no matter what device you're using.",
            "**Final Thoughts**\nThis journey of continuous improvement has been incredibly fulfilling. Every tweak and update is a step towards making my portfolio not just a website, but an immersive experience. I hope you enjoy exploring the new features as much as I enjoyed creating them.",
            "**Until next time, happy coding!**",
            "**DethCubeHax, signing out.**"
        ]
    }
]
